import main as m
import pytest


# cheking if the text is too long
def test_check_length_too_long():
	txt = '''
		Бунёдгузори адабиёти форсу тоҷик Абӯабдуллоҳ Рӯдакӣ соли 858 дар деҳаи Панҷрӯд аз тавобеъи Самарқанд (бинобар ин дар баъзе сарчашмаҳо Рӯдакии Самарқандӣ низ меноманд), 
		ки акнун рустое аз ноҳияи Панҷакент дар вилояти Суғд аст, ба дунё омадааст. 
		Таърихи ҳазору сад солаи адабиёти тоҷик бо номи бунёдгузори он устод Рӯдакӣ сахт вобаста аст. 
		Рӯдакиро муосиронаш ва суханварони баъдина бо унвонҳои ифтихорӣ: 
		Одамушуаро форсӣ: آدم الشعرا‎ Қофиласорои назми форсӣ, Соҳибқирони шоирон, Султони шоирон, Мақаддумушуаро ва ҳамсони инҳо ёд мекунанд. 
		Асосгузор ва сардафтари адабиёт аслан маънои онро надорад ки пеш аз дигарон асар эҷод карда бошад.
		'''
	assert m.check_length(txt) == False
